app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

   def create
     @restaurant = Restaurant.create(restaurant_params)
---
INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "KFC"], ["created_at", "2016-01-18 13:58:29.990028"], ["updated_at", "2016-01-18 13:58:29.990028"]]

  def show
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]